run/CHT/chtMultiRegionSimpleFoam/system/fvSolution
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-11;
        relTol           0;
    }
}

relaxationFactors
{
    T               0.999;
}


// ************************************************************************* //
